In [79]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from datetime import date,  datetime
%matplotlib inline

In [80]:
from sklearn.preprocessing import StandardScaler, OneHotEncoder
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import FeatureUnion, make_pipeline, Pipeline

In [81]:
from sklearn.tree import DecisionTreeClassifier, ExtraTreeClassifier
from sklearn.ensemble import RandomForestClassifier, ExtraTreesClassifier
from sklearn.neighbors import KNeighborsClassifier, RadiusNeighborsClassifier
from sklearn.neural_network import MLPClassifier
from sklearn.linear_model import RidgeClassifierCV
from sklearn.naive_bayes import GaussianNB
from sklearn.model_selection import GridSearchCV

In [82]:
!pip install catboost

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: catboost in /home/patrick/.local/lib/python3.6/site-packages (0.24.1)
Requirement already satisfied: numpy>=1.16.0 in /home/patrick/.local/lib/python3.6/site-packages (from catboost) (1.18.1)
Requirement already satisfied: matplotlib in /home/patrick/.local/lib/python3.6/site-packages (from catboost) (3.1.3)
Requirement already satisfied: plotly in /home/patrick/.local/lib/python3.6/site-packages (from catboost) (4.8.2)
Requirement already satisfied: six in /usr/lib/python3/dist-packages (from catboost) (1.11.0)
Requirement already satisfied: graphviz in /home/patrick/.local/lib/python3.6/site-packages (from catboost) (0.14.1)
Requirement already satisfied: pandas>=0.24.0 in /home/patrick/.local/lib/python3.6/site-packages (from catboost) (1.0.1)
Requirement already satisfied: scipy in /home/patrick/.local/lib/python3.6/site-packages (from catboost) (1.4.1)
Requirement already satisfied: kiwisolver>=1.0.1 in /home/patrick/.local/lib/python3.6/site-packages (from matplotlib->catboost) (1.1.0)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.1 in /home/patrick/.local/lib/python3.6/site-packages (from matplotlib->catboost) (2.4.6)
Requirement already satisfied: cycler>=0.10 in /home/patrick/.local/lib/python3.6/site-packages (from matplotlib->catboost) (0.10.0)
Requirement already satisfied: python-dateutil>=2.1 in /usr/lib/python3/dist-packages (from matplotlib->catboost) (2.6.1)
Requirement already satisfied: retrying>=1.3.3 in /home/patrick/.local/lib/python3.6/site-packages (from plotly->catboost) (1.3.3)
Requirement already satisfied: pytz>=2017.2 in /usr/lib/python3/dist-packages (from pandas>=0.24.0->catboost) (2018.3)
Requirement already satisfied: setuptools in /home/patrick/.local/lib/python3.6/site-packages (from kiwisolver>=1.0.1->matplotlib->catboost) (49.6.0)

In [83]:
!pip install lightgbm

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: lightgbm in /home/patrick/.local/lib/python3.6/site-packages (3.0.0)
Requirement already satisfied: scikit-learn!=0.22.0 in /home/patrick/.local/lib/python3.6/site-packages (from lightgbm) (0.23.1)
Requirement already satisfied: numpy in /home/patrick/.local/lib/python3.6/site-packages (from lightgbm) (1.18.1)
Requirement already satisfied: scipy in /home/patrick/.local/lib/python3.6/site-packages (from lightgbm) (1.4.1)
Requirement already satisfied: threadpoolctl>=2.0.0 in /home/patrick/.local/lib/python3.6/site-packages (from scikit-learn!=0.22.0->lightgbm) (2.1.0)
Requirement already satisfied: joblib>=0.11 in /home/patrick/.local/lib/python3.6/site-packages (from scikit-learn!=0.22.0->lightgbm) (0.15.1)

In [84]:
import xgboost as xgb
import catboost as cat
import lightgbm as light
from catboost import CatBoostClassifier
from sklearn.multiclass import OneVsRestClassifier

In [85]:
! pip install scikit-multilearn

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: scikit-multilearn in /home/patrick/.local/lib/python3.6/site-packages (0.2.0)

In [86]:
!pip install community

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: community in /home/patrick/.local/lib/python3.6/site-packages (1.0.0b1)
Requirement already satisfied: requests in /usr/lib/python3/dist-packages (from community) (2.18.4)
Requirement already satisfied: Flask in /usr/lib/python3/dist-packages (from community) (0.12.2)

In [87]:
!pip install networkx

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: networkx in /home/patrick/.local/lib/python3.6/site-packages (2.5)
Requirement already satisfied: decorator>=4.3.0 in /home/patrick/.local/lib/python3.6/site-packages (from networkx) (4.4.1)

In [88]:
# !pip install ipywidgets

In [89]:
from skmultilearn.problem_transform import BinaryRelevance, ClassifierChain, LabelPowerset
from skmultilearn.cluster.networkx import NetworkXLabelGraphClusterer
from skmultilearn.cluster import LabelCooccurrenceGraphBuilder
from skmultilearn.ensemble import LabelSpacePartitioningClassifier

> import datasets

In [90]:
test_path = '../datasets/Test.csv'
train_path = '../datasets/Train.csv'
sample_submission_path = '../datasets/SampleSubmission.csv'

> define utitlity functions

load data

In [91]:
def load_data(path=""):
    data = pd.read_csv(path)
    return data

move columns

In [92]:
def movecol(df, cols_to_move=[], ref_col='', place='After'):
    
    cols = df.columns.tolist()    
    if place == 'After':
        seg1 = cols[:list(cols).index(ref_col) + 1]
        seg2 = cols_to_move
    if place == 'Before':
        seg1 = cols[:list(cols).index(ref_col)]
        seg2 = cols_to_move + [ref_col]
    
    seg1 = [i for i in seg1 if i not in seg2]
    seg3 = [i for i in cols if i not in seg1 + seg2]
    
    return(df[seg1 + seg2 + seg3])

transform dates

In [93]:
def transform_dates(df, col_name='', calc_age=False, 
                    birth_year_col_name = '', drop_date=True):
    df[col_name] = pd.to_datetime(df[col_name])
    #fill empty date columns
    if df[col_name].isna().any() == True:
        fill_date = df[col_name].mode()[0]
        df[col_name] =  df[col_name].fillna(fill_date)
    
    #create new datelike features
    todays_date = date.today()
    todays_date = pd.to_datetime(todays_date)
    
    df['duration_till_date'] = (todays_date - df[col_name]).astype('str').apply(lambda x: x.split(' d'
                                                                             )[0].strip()).astype('int64')
    
    df['year'] = df[col_name].apply(lambda x: x.year)
    df['month'] = df[col_name].apply(lambda x: x.year)
    df['week_of_year'] = df[col_name].apply(lambda x: x.weekofyear)
    df['day_of_week'] = df[col_name].apply(lambda x: x.dayofweek)
    
    if calc_age:
        
        df['age'] = df['year'] - df[birth_year_col_name]
        
    
    if drop_date:
        df.drop(columns=[col_name], inplace=True)
        
    
    return df

In [94]:
def val_counts(df, columns=[]):
    for col in columns:
        print("**"*8)
        print(col)
        print("**"*8) 
        print(df[col].value_counts())

In [95]:
test_set = load_data(test_path)
train_set = load_data(train_path)
sample_submission = load_data(sample_submission_path)

In [96]:
train_set

,ID,join_date,sex,marital_status,birth_year,branch_code,occupation_code,occupation_category_code,P5DA,RIBP,...,AHXO,BSTQ,FM3X,K6QO,QBOL,JWFN,JZ9D,J9JW,GHYX,ECY3
0,4WKQSBB,1/2/2019,F,M,1987,1X1H,2A7I,T4MS,0,0,...,0,0,0,1,0,0,0,0,0,0
1,CP5S02H,1/6/2019,F,M,1981,UAOD,2A7I,T4MS,0,0,...,0,0,0,1,0,0,0,0,0,0
2,2YKDILJ,1/6/2013,M,U,1991,748L,QZYX,90QI,0,0,...,0,0,0,0,0,0,0,0,0,1
3,2S9E81J,1/8/2019,M,M,1990,1X1H,BP09,56SI,0,0,...,0,0,0,1,0,0,0,0,0,0
4,BHDYVFT,1/8/2019,M,M,1990,748L,NO3L,T4MS,0,0,...,0,0,0,0,0,0,1,1,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29127,8SBA93U,1/9/2019,F,M,1974,748L,2A7I,T4MS,0,0,...,0,0,0,1,0,0,0,0,0,0
29128,Y73ETTO,1/11/2018,M,M,1987,XX25,Q6J6,90QI,0,0,...,0,0,0,1,0,0,0,0,0,0
29129,MVXG2LC,1/2/2019,M,M,1985,BOAS,6PE7,T4MS,0,0,...,0,0,0,1,0,0,0,0,0,0
29130,BUQ8DQN,1/7/2019,M,M,1989,UAOD,2A7I,T4MS,0,0,...,0,0,0,1,0,0,0,0,0,0
29131,DEJBWYU,1/3/2020,M,M,1975,94KC,31JW,90QI,0,0,...,0,0,0,1,0,0,0,0,0,0

In [97]:
test_set

,ID,join_date,sex,marital_status,birth_year,branch_code,occupation_code,occupation_category_code,P5DA,RIBP,...,AHXO,BSTQ,FM3X,K6QO,QBOL,JWFN,JZ9D,J9JW,GHYX,ECY3
0,F86J5PC,1/12/2018,M,M,1984,94KC,DZRV,90QI,0,0,...,0,0,0,0,0,0,0,0,0,0
1,H6141K3,1/10/2019,M,M,1996,1X1H,J9SY,90QI,0,0,...,0,0,0,1,0,0,0,0,0,0
2,RBAYUXZ,1/1/2020,F,W,1968,UAOD,2A7I,T4MS,0,0,...,0,0,0,1,0,0,0,0,0,0
3,KCBILBQ,1/2/2019,M,M,1989,94KC,2A7I,T4MS,0,0,...,0,0,0,0,0,0,0,0,0,0
4,LSEC1ZJ,1/2/2020,F,M,1982,UAOD,0KID,T4MS,0,0,...,0,0,0,0,0,0,1,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,0GMU5UH,1/4/2019,F,M,1986,748L,2A7I,T4MS,0,0,...,0,0,0,0,1,0,1,0,0,0
9996,I9W11CD,1/8/2019,M,M,1980,UAOD,0KID,T4MS,0,0,...,0,0,0,0,0,0,0,0,0,0
9997,42WTEGT,1/4/2018,M,M,1993,748L,SST3,56SI,0,0,...,0,0,0,1,0,0,0,0,0,0
9998,8EKC4O9,1/5/2015,F,U,1981,49BM,2A7I,T4MS,0,0,...,0,0,0,0,0,0,0,0,0,0
9999,WHII93K,1/11/2018,M,U,1977,94KC,2A7I,T4MS,0,0,...,0,0,0,1,0,0,0,0,0,0

In [98]:
sample_submission

            ID X PCODE  Label
0       F86J5PC X P5DA      0
1       F86J5PC X RIBP      0
2       F86J5PC X 8NN1      0
3       F86J5PC X 7POT      0
4       F86J5PC X 66FJ      0
...                ...    ...
209995  WHII93K X JWFN      0
209996  WHII93K X JZ9D      0
209997  WHII93K X J9JW      0
209998  WHII93K X GHYX      0
209999  WHII93K X ECY3      0

[210000 rows x 2 columns]

### Data Cleaning

In [99]:
train_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29132 entries, 0 to 29131
Data columns (total 29 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   ID                        29132 non-null  object
 1   join_date                 29130 non-null  object
 2   sex                       29132 non-null  object
 3   marital_status            29132 non-null  object
 4   birth_year                29132 non-null  int64
 5   branch_code               29132 non-null  object
 6   occupation_code           29132 non-null  object
 7   occupation_category_code  29132 non-null  object
 8   P5DA                      29132 non-null  int64
 9   RIBP                      29132 non-null  int64
 10  8NN1                      29132 non-null  int64
 11  7POT                      29132 non-null  int64
 12  66FJ                      29132 non-null  int64
 13  GYSR                      29132 non-null  int64
 14  SOP4                      29132 non-null  int64
 15  RVSZ                      29132 non-null  int64
 16  PYUQ                      29132 non-null  int64
 17  LJR9                      29132 non-null  int64
 18  N2MW                      29132 non-null  int64
 19  AHXO                      29132 non-null  int64
 20  BSTQ                      29132 non-null  int64
 21  FM3X                      29132 non-null  int64
 22  K6QO                      29132 non-null  int64
 23  QBOL                      29132 non-null  int64
 24  JWFN                      29132 non-null  int64
 25  JZ9D                      29132 non-null  int64
 26  J9JW                      29132 non-null  int64
 27  GHYX                      29132 non-null  int64
 28  ECY3                      29132 non-null  int64
dtypes: int64(22), object(7)
memory usage: 6.4+ MB

In [100]:
test_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 29 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   ID                        10000 non-null  object
 1   join_date                 9999 non-null   object
 2   sex                       10000 non-null  object
 3   marital_status            10000 non-null  object
 4   birth_year                10000 non-null  int64
 5   branch_code               10000 non-null  object
 6   occupation_code           10000 non-null  object
 7   occupation_category_code  10000 non-null  object
 8   P5DA                      10000 non-null  int64
 9   RIBP                      10000 non-null  int64
 10  8NN1                      10000 non-null  int64
 11  7POT                      10000 non-null  int64
 12  66FJ                      10000 non-null  int64
 13  GYSR                      10000 non-null  int64
 14  SOP4                      10000 non-null  int64
 15  RVSZ                      10000 non-null  int64
 16  PYUQ                      10000 non-null  int64
 17  LJR9                      10000 non-null  int64
 18  N2MW                      10000 non-null  int64
 19  AHXO                      10000 non-null  int64
 20  BSTQ                      10000 non-null  int64
 21  FM3X                      10000 non-null  int64
 22  K6QO                      10000 non-null  int64
 23  QBOL                      10000 non-null  int64
 24  JWFN                      10000 non-null  int64
 25  JZ9D                      10000 non-null  int64
 26  J9JW                      10000 non-null  int64
 27  GHYX                      10000 non-null  int64
 28  ECY3                      10000 non-null  int64
dtypes: int64(22), object(7)
memory usage: 2.2+ MB

> Check values in train columns

In [101]:
val_counts(train_set, columns=train_set.columns.to_list())

****************
ID
****************
1UPQVCF    1
ISOC4W4    1
0YG32ID    1
4WHL9TQ    1
P567Q0K    1
          ..
SIB3D8I    1
NIFNICW    1
7XXVCZR    1
T4OOKOP    1
B4XVVBE    1
Name: ID, Length: 29132, dtype: int64
****************
join_date
****************
1/5/2018      1319
1/5/2019      1199
1/4/2018      1123
1/4/2019      1043
1/1/2019       754
              ...
22/10/2012       1
23/5/2013        1
8/9/2012         1
2/9/2012         1
11/1/2013        1
Name: join_date, Length: 132, dtype: int64
****************
sex
****************
M    20329
F     8803
Name: sex, dtype: int64
****************
marital_status
****************
M    22913
S     3267
U     2474
W      301
D      135
R       34
P        7
f        1
Name: marital_status, dtype: int64
****************
birth_year
****************
1983    1263
1984    1241
1982    1222
1980    1143
1986    1097
        ...
1932       1
2011       1
1946       1
2005       1
1936       1
Name: birth_year, Length: 61, dtype: int64
****************
branch_code
****************
748L    8136
94KC    3658
UAOD    3507
E5SW    3185
30H5    3151
XX25    2805
1X1H    1303
O67J    1125
ZFER     747
49BM     621
9F9T     429
BOAS     347
X23B      99
O4JC      10
EU3L       9
Name: branch_code, dtype: int64
****************
occupation_code
****************
2A7I    7089
0KID    3969
SST3    2711
UJ5T    2079
0OJM    1565
        ...
KUPK       1
4M0E       1
M0WG       1
FLXH       1
R7GL       1
Name: occupation_code, Length: 233, dtype: int64
****************
occupation_category_code
****************
T4MS    18619
90QI     5552
56SI     3655
L44T      628
JD7X      576
AHH5      102
Name: occupation_category_code, dtype: int64
****************
P5DA
****************
0    29092
1       40
Name: P5DA, dtype: int64
****************
RIBP
****************
0    27352
1     1780
Name: RIBP, dtype: int64
****************
8NN1
****************
0    28975
1      157
Name: 8NN1, dtype: int64
****************
7POT
****************
0    28816
1      316
Name: 7POT, dtype: int64
****************
66FJ
****************
0    28793
1      339
Name: 66FJ, dtype: int64
****************
GYSR
****************
0    29128
1        4
Name: GYSR, dtype: int64
****************
SOP4
****************
0    28701
1      431
Name: SOP4, dtype: int64
****************
RVSZ
****************
1    25328
0     3804
Name: RVSZ, dtype: int64
****************
PYUQ
****************
0    26959
1     2173
Name: PYUQ, dtype: int64
****************
LJR9
****************
0    28778
1      354
Name: LJR9, dtype: int64
****************
N2MW
****************
0    28294
1      838
Name: N2MW, dtype: int64
****************
AHXO
****************
0    28593
1      539
Name: AHXO, dtype: int64
****************
BSTQ
****************
0    28808
1      324
Name: BSTQ, dtype: int64
****************
FM3X
****************
0    29022
1      110
Name: FM3X, dtype: int64
****************
K6QO
****************
1    21629
0     7503
Name: K6QO, dtype: int64
****************
QBOL
****************
0    22299
1     6833
Name: QBOL, dtype: int64
****************
JWFN
****************
0    28821
1      311
Name: JWFN, dtype: int64
****************
JZ9D
****************
0    27707
1     1425
Name: JZ9D, dtype: int64
****************
J9JW
****************
0    27714
1     1418
Name: J9JW, dtype: int64
****************
GHYX
****************
0    28230
1      902
Name: GHYX, dtype: int64
****************
ECY3
****************
0    28030
1     1102
Name: ECY3, dtype: int64

> Check values in test columns

In [116]:
val_counts(test_set, columns=test_set.columns.to_list())

****************
ID
****************
UCFL73O    1
GPE8SKK    1
DHTZPAJ    1
7JDD83P    1
L5YJTP5    1
          ..
RM9X9AE    1
FYE72YU    1
G5VEYBG    1
21CM5Z0    1
JHEWY92    1
Name: ID, Length: 10000, dtype: int64
****************
age
****************
35    410
30    393
33    393
37    392
34    391
36    390
32    374
31    369
39    364
38    348
29    347
40    336
42    330
28    328
44    327
41    325
43    315
45    298
46    292
27    275
47    271
26    244
48    243
49    242
25    221
50    216
51    175
24    163
52    140
23    133
53    120
22    102
54     97
58     93
55     88
21     81
57     78
56     73
59     72
60     50
20     49
19     25
61     10
18      6
17      3
64      3
62      2
65      1
74      1
87      1
Name: age, dtype: int64
****************
duration_till_date
****************
973     514
608     395
974     369
609     336
607     289
       ...
3895      2
2872      1
3892      1
2979      1
3130      1
Name: duration_till_date, Length: 126, dtype: int64
****************
year
****************
2019    3007
2018    2477
2017    1516
2020    1142
2016     782
2015     306
2014     229
2013     220
2012     175
2011     111
2010      35
Name: year, dtype: int64
****************
month
****************
2019    3007
2018    2477
2017    1516
2020    1142
2016     782
2015     306
2014     229
2013     220
2012     175
2011     111
2010      35
Name: month, dtype: int64
****************
week_of_year
****************
1     5967
2     3834
53     100
52      82
3       14
6        1
28       1
43       1
Name: week_of_year, dtype: int64
****************
day_of_week
****************
4    1830
3    1626
1    1476
5    1428
2    1411
0    1133
6    1096
Name: day_of_week, dtype: int64
****************
sex
****************
M    6845
F    3155
Name: sex, dtype: int64
****************
marital_status
****************
M    7878
S    1116
U     843
W     105
D      51
R       5
P       1
F       1
Name: marital_status, dtype: int64
****************
birth_year
****************
1984    452
1982    439
1983    433
1985    391
1986    365
1980    363
1988    354
1976    353
1979    345
1989    344
1987    336
1981    336
1975    330
1977    324
1978    318
1973    317
1990    301
1970    296
1972    291
1974    290
1991    283
1969    262
1971    224
1968    223
1992    211
1967    196
1994    181
1993    156
1966    153
1995    147
1964    111
1965     99
1962     99
1960     97
1996     86
1963     79
1959     72
1997     70
1961     62
1998     60
1958     52
1999     30
1957     23
2000     17
1955      7
2001      4
1953      4
1956      4
1954      3
1952      2
1946      1
1937      1
1948      1
1933      1
1951      1
Name: birth_year, dtype: int64
****************
branch_code
****************
748L    2783
UAOD    1207
94KC    1191
30H5    1114
E5SW    1069
XX25     999
1X1H     435
O67J     413
ZFER     274
49BM     196
9F9T     146
BOAS     130
X23B      33
O4JC       6
EU3L       4
Name: branch_code, dtype: int64
****************
occupation_code
****************
2A7I    2405
0KID    1465
SST3     943
UJ5T     697
0OJM     542
        ...
2G86       1
QQVA       1
KPG9       1
CYDC       1
WIWP       1
Name: occupation_code, Length: 187, dtype: int64
****************
occupation_category_code
****************
T4MS    6383
90QI    1927
56SI    1262
L44T     208
JD7X     191
AHH5      29
Name: occupation_category_code, dtype: int64
****************
P5DA
****************
0    9995
1       5
Name: P5DA, dtype: int64
****************
RIBP
****************
0    9700
1     300
Name: RIBP, dtype: int64
****************
8NN1
****************
0    9964
1      36
Name: 8NN1, dtype: int64
****************
7POT
****************
0    9936
1      64
Name: 7POT, dtype: int64
****************
66FJ
****************
0    9926
1      74
Name: 66FJ, dtype: int64
****************
GYSR
****************
0    9999
1       1
Name: GYSR, dtype: int64
****************
SOP4
****************
0    9922
1      78
Name: SOP4, dtype: int64
****************
RVSZ
****************
0    5272
1    4728
Name: RVSZ, dtype: int64
****************
PYUQ
****************
0    9535
1     465
Name: PYUQ, dtype: int64
****************
LJR9
****************
0    9922
1      78
Name: LJR9, dtype: int64
****************
N2MW
****************
0    9859
1     141
Name: N2MW, dtype: int64
****************
AHXO
****************
0    9900
1     100
Name: AHXO, dtype: int64
****************
BSTQ
****************
0    9898
1     102
Name: BSTQ, dtype: int64
****************
FM3X
****************
0    9971
1      29
Name: FM3X, dtype: int64
****************
K6QO
****************
0    5976
1    4024
Name: K6QO, dtype: int64
****************
QBOL
****************
0    8500
1    1500
Name: QBOL, dtype: int64
****************
JWFN
****************
0    9934
1      66
Name: JWFN, dtype: int64
****************
JZ9D
****************
0    9680
1     320
Name: JZ9D, dtype: int64
****************
J9JW
****************
0    9677
1     323
Name: J9JW, dtype: int64
****************
GHYX
****************
0    9814
1     186
Name: GHYX, dtype: int64
****************
ECY3
****************
0    9767
1     233
Name: ECY3, dtype: int64

> For every product codes, there is an `imbalance in the class`. lesser product patronage among the class

In [103]:
train_set.isna().any()

ID                          False
join_date                    True
sex                         False
marital_status              False
birth_year                  False
branch_code                 False
occupation_code             False
occupation_category_code    False
P5DA                        False
RIBP                        False
8NN1                        False
7POT                        False
66FJ                        False
GYSR                        False
SOP4                        False
RVSZ                        False
PYUQ                        False
LJR9                        False
N2MW                        False
AHXO                        False
BSTQ                        False
FM3X                        False
K6QO                        False
QBOL                        False
JWFN                        False
JZ9D                        False
J9JW                        False
GHYX                        False
ECY3                        False
dtype: bool

date as empty rows

In [104]:
test_set.isna().any()

ID                          False
join_date                    True
sex                         False
marital_status              False
birth_year                  False
branch_code                 False
occupation_code             False
occupation_category_code    False
P5DA                        False
RIBP                        False
8NN1                        False
7POT                        False
66FJ                        False
GYSR                        False
SOP4                        False
RVSZ                        False
PYUQ                        False
LJR9                        False
N2MW                        False
AHXO                        False
BSTQ                        False
FM3X                        False
K6QO                        False
QBOL                        False
JWFN                        False
JZ9D                        False
J9JW                        False
GHYX                        False
ECY3                        False
dtype: bool

no more null values in date

### Feature Enngineering

> feature engineer dates and time

In [105]:
train_set = transform_dates(train_set, col_name='join_date', calc_age=True, 
                            birth_year_col_name='birth_year') #drop_date=True)

In [106]:
test_set = transform_dates(test_set, col_name='join_date', calc_age=True, 
                            birth_year_col_name='birth_year') #drop_date=True)

In [107]:
train_set.head()

,ID,sex,marital_status,birth_year,branch_code,occupation_code,occupation_category_code,P5DA,RIBP,8NN1,...,JZ9D,J9JW,GHYX,ECY3,duration_till_date,year,month,week_of_year,day_of_week,age
0,4WKQSBB,F,M,1987,1X1H,2A7I,T4MS,0,0,0,...,0,0,0,0,611,2019,2019,1,2,32
1,CP5S02H,F,M,1981,UAOD,2A7I,T4MS,0,0,0,...,0,0,0,0,607,2019,2019,1,6,38
2,2YKDILJ,M,U,1991,748L,QZYX,90QI,0,0,0,...,0,0,0,1,2798,2013,2013,1,6,22
3,2S9E81J,M,M,1990,1X1H,BP09,56SI,0,0,0,...,0,0,0,0,605,2019,2019,2,1,29
4,BHDYVFT,M,M,1990,748L,NO3L,T4MS,0,0,0,...,1,1,0,0,605,2019,2019,2,1,29

In [108]:
test_set.head()

,ID,sex,marital_status,birth_year,branch_code,occupation_code,occupation_category_code,P5DA,RIBP,8NN1,...,JZ9D,J9JW,GHYX,ECY3,duration_till_date,year,month,week_of_year,day_of_week,age
0,F86J5PC,M,M,1984,94KC,DZRV,90QI,0,0,0,...,0,0,0,0,966,2018,2018,2,4,34
1,H6141K3,M,M,1996,1X1H,J9SY,90QI,0,0,0,...,0,0,0,0,603,2019,2019,2,3,23
2,RBAYUXZ,F,W,1968,UAOD,2A7I,T4MS,0,0,0,...,0,0,0,0,247,2020,2020,1,2,52
3,KCBILBQ,M,M,1989,94KC,2A7I,T4MS,0,0,0,...,0,0,0,0,611,2019,2019,1,2,30
4,LSEC1ZJ,F,M,1982,UAOD,0KID,T4MS,0,0,0,...,1,0,0,0,246,2020,2020,1,3,38

In [109]:
train_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29132 entries, 0 to 29131
Data columns (total 34 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   ID                        29132 non-null  object
 1   sex                       29132 non-null  object
 2   marital_status            29132 non-null  object
 3   birth_year                29132 non-null  int64
 4   branch_code               29132 non-null  object
 5   occupation_code           29132 non-null  object
 6   occupation_category_code  29132 non-null  object
 7   P5DA                      29132 non-null  int64
 8   RIBP                      29132 non-null  int64
 9   8NN1                      29132 non-null  int64
 10  7POT                      29132 non-null  int64
 11  66FJ                      29132 non-null  int64
 12  GYSR                      29132 non-null  int64
 13  SOP4                      29132 non-null  int64
 14  RVSZ                      29132 non-null  int64
 15  PYUQ                      29132 non-null  int64
 16  LJR9                      29132 non-null  int64
 17  N2MW                      29132 non-null  int64
 18  AHXO                      29132 non-null  int64
 19  BSTQ                      29132 non-null  int64
 20  FM3X                      29132 non-null  int64
 21  K6QO                      29132 non-null  int64
 22  QBOL                      29132 non-null  int64
 23  JWFN                      29132 non-null  int64
 24  JZ9D                      29132 non-null  int64
 25  J9JW                      29132 non-null  int64
 26  GHYX                      29132 non-null  int64
 27  ECY3                      29132 non-null  int64
 28  duration_till_date        29132 non-null  int64
 29  year                      29132 non-null  int64
 30  month                     29132 non-null  int64
 31  week_of_year              29132 non-null  int64
 32  day_of_week               29132 non-null  int64
 33  age                       29132 non-null  int64
dtypes: int64(28), object(6)
memory usage: 7.6+ MB

In [110]:
train_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29132 entries, 0 to 29131
Data columns (total 34 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   ID                        29132 non-null  object
 1   sex                       29132 non-null  object
 2   marital_status            29132 non-null  object
 3   birth_year                29132 non-null  int64
 4   branch_code               29132 non-null  object
 5   occupation_code           29132 non-null  object
 6   occupation_category_code  29132 non-null  object
 7   P5DA                      29132 non-null  int64
 8   RIBP                      29132 non-null  int64
 9   8NN1                      29132 non-null  int64
 10  7POT                      29132 non-null  int64
 11  66FJ                      29132 non-null  int64
 12  GYSR                      29132 non-null  int64
 13  SOP4                      29132 non-null  int64
 14  RVSZ                      29132 non-null  int64
 15  PYUQ                      29132 non-null  int64
 16  LJR9                      29132 non-null  int64
 17  N2MW                      29132 non-null  int64
 18  AHXO                      29132 non-null  int64
 19  BSTQ                      29132 non-null  int64
 20  FM3X                      29132 non-null  int64
 21  K6QO                      29132 non-null  int64
 22  QBOL                      29132 non-null  int64
 23  JWFN                      29132 non-null  int64
 24  JZ9D                      29132 non-null  int64
 25  J9JW                      29132 non-null  int64
 26  GHYX                      29132 non-null  int64
 27  ECY3                      29132 non-null  int64
 28  duration_till_date        29132 non-null  int64
 29  year                      29132 non-null  int64
 30  month                     29132 non-null  int64
 31  week_of_year              29132 non-null  int64
 32  day_of_week               29132 non-null  int64
 33  age                       29132 non-null  int64
dtypes: int64(28), object(6)
memory usage: 7.6+ MB

> reorder columns

In [111]:
train_set = movecol(train_set, ['age','duration_till_date', 'year', 'month', 
                                'week_of_year', 'day_of_week'], ref_col='ID')

In [112]:
test_set = movecol(test_set, ['age','duration_till_date', 'year', 'month', 
                                'week_of_year', 'day_of_week'], ref_col='ID')

In [113]:
train_set.head()

,ID,age,duration_till_date,year,month,week_of_year,day_of_week,sex,marital_status,birth_year,...,AHXO,BSTQ,FM3X,K6QO,QBOL,JWFN,JZ9D,J9JW,GHYX,ECY3
0,4WKQSBB,32,611,2019,2019,1,2,F,M,1987,...,0,0,0,1,0,0,0,0,0,0
1,CP5S02H,38,607,2019,2019,1,6,F,M,1981,...,0,0,0,1,0,0,0,0,0,0
2,2YKDILJ,22,2798,2013,2013,1,6,M,U,1991,...,0,0,0,0,0,0,0,0,0,1
3,2S9E81J,29,605,2019,2019,2,1,M,M,1990,...,0,0,0,1,0,0,0,0,0,0
4,BHDYVFT,29,605,2019,2019,2,1,M,M,1990,...,0,0,0,0,0,0,1,1,0,0

In [114]:
test_set.head()

,ID,age,duration_till_date,year,month,week_of_year,day_of_week,sex,marital_status,birth_year,...,AHXO,BSTQ,FM3X,K6QO,QBOL,JWFN,JZ9D,J9JW,GHYX,ECY3
0,F86J5PC,34,966,2018,2018,2,4,M,M,1984,...,0,0,0,0,0,0,0,0,0,0
1,H6141K3,23,603,2019,2019,2,3,M,M,1996,...,0,0,0,1,0,0,0,0,0,0
2,RBAYUXZ,52,247,2020,2020,1,2,F,W,1968,...,0,0,0,1,0,0,0,0,0,0
3,KCBILBQ,30,611,2019,2019,1,2,M,M,1989,...,0,0,0,0,0,0,0,0,0,0
4,LSEC1ZJ,38,246,2020,2020,1,3,F,M,1982,...,0,0,0,0,0,0,1,0,0,0

In [115]:
train_set.columns

Index(['ID', 'age', 'duration_till_date', 'year', 'month', 'week_of_year',
       'day_of_week', 'sex', 'marital_status', 'birth_year', 'branch_code',
       'occupation_code', 'occupation_category_code', 'P5DA', 'RIBP', '8NN1',
       '7POT', '66FJ', 'GYSR', 'SOP4', 'RVSZ', 'PYUQ', 'LJR9', 'N2MW', 'AHXO',
       'BSTQ', 'FM3X', 'K6QO', 'QBOL', 'JWFN', 'JZ9D', 'J9JW', 'GHYX', 'ECY3'],
      dtype='object')

#### Further Feature Engineering

-  get product use frequency per user

In [117]:
train_product_ids  = train_set.columns.to_list()[13:]
train_product_ids

['P5DA',
 'RIBP',
 '8NN1',
 '7POT',
 '66FJ',
 'GYSR',
 'SOP4',
 'RVSZ',
 'PYUQ',
 'LJR9',
 'N2MW',
 'AHXO',
 'BSTQ',
 'FM3X',
 'K6QO',
 'QBOL',
 'JWFN',
 'JZ9D',
 'J9JW',
 'GHYX',
 'ECY3']

In [120]:
test_product_ids  = test_set.columns.to_list()[13:]
test_product_ids

['P5DA',
 'RIBP',
 '8NN1',
 '7POT',
 '66FJ',
 'GYSR',
 'SOP4',
 'RVSZ',
 'PYUQ',
 'LJR9',
 'N2MW',
 'AHXO',
 'BSTQ',
 'FM3X',
 'K6QO',
 'QBOL',
 'JWFN',
 'JZ9D',
 'J9JW',
 'GHYX',
 'ECY3']

In [121]:
f'lenght of insurance products {len(train_product_ids)}'

'lenght of insurance products 21'

In [122]:
non_product_cols = train_set.iloc[:, :12].columns.tolist()

In [123]:
non_product_cols

['ID',
 'age',
 'duration_till_date',
 'year',
 'month',
 'week_of_year',
 'day_of_week',
 'sex',
 'marital_status',
 'birth_year',
 'branch_code',
 'occupation_code']

In [124]:
train_set=train_set.melt(id_vars=non_product_cols, value_vars=train_product_ids, var_name='product_ids', value_name='labels')

In [125]:
test_set=test_set.melt(id_vars=non_product_cols, value_vars=test_product_ids, var_name='product_ids', value_name='labels')

In [127]:
train_set.head()

,ID,age,duration_till_date,year,month,week_of_year,day_of_week,sex,marital_status,birth_year,branch_code,occupation_code,product_ids,labels
0,4WKQSBB,32,611,2019,2019,1,2,F,M,1987,1X1H,2A7I,P5DA,0
1,CP5S02H,38,607,2019,2019,1,6,F,M,1981,UAOD,2A7I,P5DA,0
2,2YKDILJ,22,2798,2013,2013,1,6,M,U,1991,748L,QZYX,P5DA,0
3,2S9E81J,29,605,2019,2019,2,1,M,M,1990,1X1H,BP09,P5DA,0
4,BHDYVFT,29,605,2019,2019,2,1,M,M,1990,748L,NO3L,P5DA,0

In [128]:
test_set.head()

,ID,age,duration_till_date,year,month,week_of_year,day_of_week,sex,marital_status,birth_year,branch_code,occupation_code,product_ids,labels
0,F86J5PC,34,966,2018,2018,2,4,M,M,1984,94KC,DZRV,P5DA,0
1,H6141K3,23,603,2019,2019,2,3,M,M,1996,1X1H,J9SY,P5DA,0
2,RBAYUXZ,52,247,2020,2020,1,2,F,W,1968,UAOD,2A7I,P5DA,0
3,KCBILBQ,30,611,2019,2019,1,2,M,M,1989,94KC,2A7I,P5DA,0
4,LSEC1ZJ,38,246,2020,2020,1,3,F,M,1982,UAOD,0KID,P5DA,0

> sort dataset by customer ID and product id

In [129]:
train_set.sort_values(by=['ID','product_ids' ], inplace=True)

In [130]:
test_set.sort_values(by=['ID','product_ids' ], inplace=True)

> concatenate user ID and producct id

In [131]:
train_set['ID X PCODE'] = train_set.ID+' X '+train_set.product_ids

In [132]:
train_set['ID X PCODE']

135107    001IIBS X 66FJ
105975    001IIBS X 7POT
76843     001IIBS X 8NN1
339031    001IIBS X AHXO
368163    001IIBS X BSTQ
               ...
260571    ZZZU5BE X PYUQ
464495    ZZZU5BE X QBOL
56647     ZZZU5BE X RIBP
231439    ZZZU5BE X RVSZ
202307    ZZZU5BE X SOP4
Name: ID X PCODE, Length: 611772, dtype: object

In [133]:
test_set['ID X PCODE'] = test_set.ID+' X '+train_set.product_ids
test_set['ID X PCODE']

49842     0021EE1 X RIBP
39842     0021EE1 X RIBP
29842     0021EE1 X RIBP
119842    0021EE1 X 66FJ
129842    0021EE1 X 66FJ
               ...
86019     ZZYM5CT X 8NN1
156019    ZZYM5CT X GYSR
16019     ZZYM5CT X P5DA
76019     ZZYM5CT X 8NN1
66019     ZZYM5CT X 8NN1
Name: ID X PCODE, Length: 210000, dtype: object

In [137]:
train_set = movecol(train_set, cols_to_move=['ID X PCODE'], ref_col='ID')

In [138]:
test_set = movecol(test_set, cols_to_move=['ID X PCODE'], ref_col='ID')

<!-- > concatenate product ID and customer ID -->

In [344]:
train_set.head(2)

,ID,ID X PCODE,age,duration_till_date,year,month,week_of_year,day_of_week,sex,marital_status,birth_year,branch_code,occupation_code,product_ids,labels
135107,001IIBS,001IIBS X 66FJ,36,605,2019,2019,2,1,F,M,1983,9F9T,31JW,66FJ,0
105975,001IIBS,001IIBS X 7POT,36,605,2019,2019,2,1,F,M,1983,9F9T,31JW,7POT,0

In [142]:
test_ = train_set.copy()

In [145]:
test_

,ID,ID X PCODE,age,duration_till_date,year,month,week_of_year,day_of_week,sex,marital_status,birth_year,branch_code,occupation_code,product_ids,labels
135107,001IIBS,001IIBS X 66FJ,36,605,2019,2019,2,1,F,M,1983,9F9T,31JW,66FJ,0
105975,001IIBS,001IIBS X 7POT,36,605,2019,2019,2,1,F,M,1983,9F9T,31JW,7POT,0
76843,001IIBS,001IIBS X 8NN1,36,605,2019,2019,2,1,F,M,1983,9F9T,31JW,8NN1,0
339031,001IIBS,001IIBS X AHXO,36,605,2019,2019,2,1,F,M,1983,9F9T,31JW,AHXO,0
368163,001IIBS,001IIBS X BSTQ,36,605,2019,2019,2,1,F,M,1983,9F9T,31JW,BSTQ,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
260571,ZZZU5BE,ZZZU5BE X PYUQ,25,608,2019,2019,1,5,M,M,1994,94KC,2A7I,PYUQ,0
464495,ZZZU5BE,ZZZU5BE X QBOL,25,608,2019,2019,1,5,M,M,1994,94KC,2A7I,QBOL,0
56647,ZZZU5BE,ZZZU5BE X RIBP,25,608,2019,2019,1,5,M,M,1994,94KC,2A7I,RIBP,0
231439,ZZZU5BE,ZZZU5BE X RVSZ,25,608,2019,2019,1,5,M,M,1994,94KC,2A7I,RVSZ,1
202307,ZZZU5BE,ZZZU5BE X SOP4,25,608,2019,2019,1,5,M,M,1994,94KC,2A7I,SOP4,0

In [275]:
class_counts_per_products = pd.DataFrame(test_.groupby(['product_ids', 'labels'])['labels'].count()
            ).rename(columns={'labels':'vals'})

In [278]:
class_counts_per_products.head()

                     vals
product_ids labels
66FJ        0       28793
            1         339
7POT        0       28816
            1         316
8NN1        0       28975

In [288]:
class_counts_per_products = class_counts_per_products.reset_index().pivot(index='product_ids', columns='labels')#.reset_index()

In [294]:
class_counts_per_products

              vals
labels           0      1
product_ids
66FJ         28793    339
7POT         28816    316
8NN1         28975    157
AHXO         28593    539
BSTQ         28808    324
ECY3         28030   1102
FM3X         29022    110
GHYX         28230    902
GYSR         29128      4
J9JW         27714   1418
JWFN         28821    311
JZ9D         27707   1425
K6QO          7503  21629
LJR9         28778    354
N2MW         28294    838
P5DA         29092     40
PYUQ         26959   2173
QBOL         22299   6833
RIBP         27352   1780
RVSZ          3804  25328
SOP4         28701    431

In [302]:
class_counts_per_products = class_counts_per_products['vals']

In [325]:
class_counts_per_products = class_counts_per_products.reset_index().rename(columns={0:'no_purchase', 1:'purchase'})

In [327]:
class_counts_per_products.sort_values(by='purchase', ascending=False, inplace=True)

In [338]:
class_counts_per_products.columns.name = None

In [377]:
patronage_label = pd.DataFrame(class_counts_per_products.purchase.describe(percentiles=[
    .1,.25, .50, .75, 1])[['10%','25%','50%', '75%', '100%']]).reset_index().rename(columns={
    'index':'patronage', 'purchase':'value'})

In [400]:
patronage_label.rename(index={0:'very_poor', 1:'poor', 2:'avg', 3:'good', 4:'excellent'}, inplace=True)

In [401]:
patronage_label

          patronage    value
very_poor       10%    110.0
poor            25%    316.0
avg             50%    539.0
good            75%   1425.0
excellent      100%  25328.0

In [402]:
pat_dic = patronage_label.value.to_dict()
pat_dic

{'very_poor': 110.0,
 'poor': 316.0,
 'avg': 539.0,
 'good': 1425.0,
 'excellent': 25328.0}

In [416]:
labels = []

for k, v in pat_dic.items():
    for i in class_counts_per_products.purchase.to_list():
        if i <= v:
            labels.append(k)
        else:
            pass

In [417]:
len(labels)

57

In [ ]:
class_counts_per_products['labels'] =

> Defince function to label a product in relation to percentile

- 10% very poor

- 25% poor

- 50% average

- 75% good

- 100% excellent

In [391]:
def label_patronage(df, col_name=''):
    
    ratings = pd.DataFrame(df[col_name].describe(percentiles=[
    .1,.25, .50, .75, 1])[['10%','25%','50%', '75%', '100%']]).reset_index().rename(columns={
    'index':'patronage', 'purchase':'value'})

In [345]:
class_counts_per_products

   product_ids  no_purchase  purchase
19        RVSZ         3804     25328
12        K6QO         7503     21629
17        QBOL        22299      6833
16        PYUQ        26959      2173
18        RIBP        27352      1780
11        JZ9D        27707      1425
9         J9JW        27714      1418
5         ECY3        28030      1102
7         GHYX        28230       902
14        N2MW        28294       838
3         AHXO        28593       539
20        SOP4        28701       431
13        LJR9        28778       354
0         66FJ        28793       339
4         BSTQ        28808       324
1         7POT        28816       316
10        JWFN        28821       311
2         8NN1        28975       157
6         FM3X        29022       110
15        P5DA        29092        40
8         GYSR        29128         4

In [140]:
# val_counts(train_set, train_set.columns.to_list())

> Find ratio of class

In [837]:
train_set.labels.value_counts()

0    545419
1     66353
Name: labels, dtype: int64

The total number of subscriptions is more than no subscriptions -> imbalanced class

#### Prepare Baseline Model

In [843]:
base_model_data = train_set.drop(columns=['ID', 'labels'])

In [844]:
base_model_data

,age,duration_till_date,year,month,week_of_year,day_of_week,sex,marital_status,birth_year,branch_code,occupation_code,product_ids
135107,36,605,2019,2019,2,1,F,M,1983,9F9T,31JW,66FJ
105975,36,605,2019,2019,2,1,F,M,1983,9F9T,31JW,7POT
76843,36,605,2019,2019,2,1,F,M,1983,9F9T,31JW,8NN1
339031,36,605,2019,2019,2,1,F,M,1983,9F9T,31JW,AHXO
368163,36,605,2019,2019,2,1,F,M,1983,9F9T,31JW,BSTQ
...,...,...,...,...,...,...,...,...,...,...,...,...
260571,25,608,2019,2019,1,5,M,M,1994,94KC,2A7I,PYUQ
464495,25,608,2019,2019,1,5,M,M,1994,94KC,2A7I,QBOL
56647,25,608,2019,2019,1,5,M,M,1994,94KC,2A7I,RIBP
231439,25,608,2019,2019,1,5,M,M,1994,94KC,2A7I,RVSZ
202307,25,608,2019,2019,1,5,M,M,1994,94KC,2A7I,SOP4

> Create a Pipeline to preprocess categorical and numerical columns

In [848]:
base_cat = base_model_data.select_dtypes(include='object')
base_cat

       sex marital_status branch_code occupation_code product_ids
135107   F              M        9F9T            31JW        66FJ
105975   F              M        9F9T            31JW        7POT
76843    F              M        9F9T            31JW        8NN1
339031   F              M        9F9T            31JW        AHXO
368163   F              M        9F9T            31JW        BSTQ
...     ..            ...         ...             ...         ...
260571   M              M        94KC            2A7I        PYUQ
464495   M              M        94KC            2A7I        QBOL
56647    M              M        94KC            2A7I        RIBP
231439   M              M        94KC            2A7I        RVSZ
202307   M              M        94KC            2A7I        SOP4

[611772 rows x 5 columns]

In [849]:
base_num = base_model_data.select_dtypes(include='int64')
base_num

,age,duration_till_date,year,month,week_of_year,day_of_week,birth_year
135107,36,605,2019,2019,2,1,1983
105975,36,605,2019,2019,2,1,1983
76843,36,605,2019,2019,2,1,1983
339031,36,605,2019,2019,2,1,1983
368163,36,605,2019,2019,2,1,1983
...,...,...,...,...,...,...,...
260571,25,608,2019,2019,1,5,1994
464495,25,608,2019,2019,1,5,1994
56647,25,608,2019,2019,1,5,1994
231439,25,608,2019,2019,1,5,1994
202307,25,608,2019,2019,1,5,1994

In [ ]:
transformed_df = ColumnTransformer()

In [ ]:
create_dummies(base_model_data, columns= base_model_data.)

> Further Feature Engineering

In [838]:
train_set

,ID,age,duration_till_date,year,month,week_of_year,day_of_week,sex,marital_status,birth_year,branch_code,occupation_code,product_ids,labels
135107,001IIBS,36,605,2019,2019,2,1,F,M,1983,9F9T,31JW,66FJ,0
105975,001IIBS,36,605,2019,2019,2,1,F,M,1983,9F9T,31JW,7POT,0
76843,001IIBS,36,605,2019,2019,2,1,F,M,1983,9F9T,31JW,8NN1,0
339031,001IIBS,36,605,2019,2019,2,1,F,M,1983,9F9T,31JW,AHXO,0
368163,001IIBS,36,605,2019,2019,2,1,F,M,1983,9F9T,31JW,BSTQ,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
260571,ZZZU5BE,25,608,2019,2019,1,5,M,M,1994,94KC,2A7I,PYUQ,0
464495,ZZZU5BE,25,608,2019,2019,1,5,M,M,1994,94KC,2A7I,QBOL,0
56647,ZZZU5BE,25,608,2019,2019,1,5,M,M,1994,94KC,2A7I,RIBP,0
231439,ZZZU5BE,25,608,2019,2019,1,5,M,M,1994,94KC,2A7I,RVSZ,1
202307,ZZZU5BE,25,608,2019,2019,1,5,M,M,1994,94KC,2A7I,SOP4,0

In [840]:
train_set.groupby('product_ids')['ID'].count()

product_ids
66FJ    29132
7POT    29132
8NN1    29132
AHXO    29132
BSTQ    29132
ECY3    29132
FM3X    29132
GHYX    29132
GYSR    29132
J9JW    29132
JWFN    29132
JZ9D    29132
K6QO    29132
LJR9    29132
N2MW    29132
P5DA    29132
PYUQ    29132
QBOL    29132
RIBP    29132
RVSZ    29132
SOP4    29132
Name: ID, dtype: int64

#### Modelling